10/data/attachments/2f46ca254f59bd08.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_87503369-b0b0-4cf9-ba8a-ccf7404b5ec5</nif:username>
            <nif:friendToBeAdded>Nicholas_but_Actions_54795_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>